const markers = [];
let userLocation = '';

const mapContainer = document.getElementById('map') // 지도를 표시할 div
const loading = document.querySelector('.loading');

const mapOption = {
    center: new kakao.maps.LatLng(37.56646, 126.98121), // 지도의 중심좌표
    level: 3, // 지도의 확대 레벨
    mapTypeId: kakao.maps.MapTypeId.ROADMAP // 지도종류
};

// 지도를 생성한다
const map = new kakao.maps.Map(mapContainer, mapOption);

function locationLoadSuccess(pos) {
    loading.classList.add('active');
    // 현재 위치 받아오기
    const currentPos = new kakao.maps.LatLng(pos.coords.latitude, pos.coords.longitude);

    geocoder.coord2RegionCode(currentPos.La, currentPos.Ma, getResult);

    // 지도 이동(기존 위치와 가깝다면 부드럽게 이동)
    map.panTo(currentPos);

    // 마커 생성
    var marker = new kakao.maps.Marker({
        position: currentPos
    });

    markers.push(marker);

    // 기존에 마커가 있다면 제거
    marker.setMap(null);
    marker.setMap(map);

};

function getResult(result, status) {
    userLocation = result[0].address_name;
    const Gu = userLocation.split(' ').find(word => word.slice(-1) === "구");
    console.log(Gu);
    getNearbyUserLocation(Gu);
}

function locationLoadError(pos) {
    alert('위치 정보를 가져오는데 실패했습니다.');
};

// 위치 가져오기 버튼 클릭시
function getCurrentPosBtn() {
    navigator.geolocation.getCurrentPosition(locationLoadSuccess, locationLoadError);
};

const locationBtn = document.querySelector('.location-btn');
locationBtn.addEventListener('click', () => {
    getCurrentPosBtn();
})

// ----------------------------------------- 키워드로 장소검색 -----------------------------------------
const searchBtn = document.querySelector('.search-btn');
const searchContent = document.querySelector('.search-query');
const form = document.querySelector('.input-group');
const locationList = document.getElementById('location-list');
let searchValue = '';

// 마커를 클릭하면 장소명을 표출할 인포윈도우 입니다
var infowindow = new kakao.maps.InfoWindow({ zIndex: 1 });
// 장소 검색 객체를 생성합니다
var ps = new kakao.maps.services.Places();

form.addEventListener('submit', (e) => {
    e.preventDefault();
    locationList.innerHTML = ``;

    const inputDoc = e.target.querySelector('.search-query');
    searchValue = inputDoc.value;

    if (searchValue == '') {
        alert("다시 검색해주세요 :)"); // ㄴ
    } else {
        // 키워드로 장소를 검색합니다
        ps.keywordSearch(searchValue, placesSearchCB);
    }
    // 기존의 마크를 모두 삭제
    markers.map(marker => marker.setMap(null));
    console.log(markers);

    inputDoc.value = '';
    inputDoc.focus();
})

// console.log(searchValue); null

// 키워드 검색 완료 시 호출되는 콜백함수 입니다
function placesSearchCB(data, status) {
    if (status === kakao.maps.services.Status.OK) {

        // 검색된 장소 위치를 기준으로 지도 범위를 재설정하기위해
        // LatLngBounds 객체에 좌표를 추가합니다
        var bounds = new kakao.maps.LatLngBounds();

        for (var i = 0; i < data.length; i++) {
            displayMarker(data[i]);
            bounds.extend(new kakao.maps.LatLng(data[i].y, data[i].x));
        }

        // 검색된 장소 위치를 기준으로 지도 범위를 재설정합니다
        map.setBounds(bounds);

        createDataList(data);
    }
}

// 지도에 마커를 표시하는 함수입니다
function displayMarker(place) {

    // 마커를 생성하고 지도에 표시합니다
    var marker = new kakao.maps.Marker({
        map: map,
        position: new kakao.maps.LatLng(place.y, place.x)
    });

    markers.push(marker);

    // 마커에 클릭이벤트를 등록합니다
    kakao.maps.event.addListener(marker, 'click', function () {
        // 마커를 클릭하면 장소명이 인포윈도우에 표출됩니다
        infowindow.setContent('<div style="padding:5px;font-size:12px;">' + place.place_name + '</div>');
        infowindow.open(map, marker);
    });
}

function createDataList(results) {
    results.map(location => {
        const elem = document.createElement("LI");
        elem.classList.add('searched-location');
        elem.innerHTML = `<div class="result-inner">
            주소: ${location.road_address_name} </br>
            분류: ${location.category_name} </br>
            연락처: ${location.phone}</br>
            </div>
        `;
        console.log(elem);

        locationList.appendChild(elem);
    });
}

// ----------------------------------------- 좌표로 주소 얻어내기-----------------------------------------

// 주소-좌표 변환 객체를 생성합니다
var geocoder = new kakao.maps.services.Geocoder();

var addrMarker = new kakao.maps.Marker(), // 클릭한 위치를 표시할 마커입니다
    addrInfoWindow = new kakao.maps.InfoWindow({ zindex: 1 }); // 클릭한 위치에 대한 주소를 표시할 인포윈도우입니다

// 현재 지도 중심좌표로 주소를 검색해서 지도 좌측 상단에 표시합니다
searchAddrFromCoords(map.getCenter(), displayCenterInfo);

// 지도를 클릭했을 때 클릭 위치 좌표에 대한 주소정보를 표시하도록 이벤트를 등록합니다
kakao.maps.event.addListener(map, 'click', function (mouseEvent) {
    searchDetailAddrFromCoords(mouseEvent.latLng, function (result, status) {
        if (status === kakao.maps.services.Status.OK) {
            var detailAddr = !!result[0].road_address ? '<div>도로명주소 : ' + result[0].road_address.address_name + '</div>' : '';
            detailAddr += '<div>지번 주소 : ' + result[0].address.address_name + '</div>';

            var content = '<div class="bAddr">' +
                '<span class="addr-title">법정동 주소정보</span>' +
                detailAddr +
                '</div>';

            // 마커를 클릭한 위치에 표시합니다 
            addrMarker.setPosition(mouseEvent.latLng);
            addrMarker.setMap(map);

            // markers.push(addrMarker);

            // 인포윈도우에 클릭한 위치에 대한 법정동 상세 주소정보를 표시합니다
            addrInfoWindow.setContent(content);
            addrInfoWindow.open(map, addrMarker);
        }
    });
});

// 중심 좌표나 확대 수준이 변경됐을 때 지도 중심 좌표에 대한 주소 정보를 표시하도록 이벤트를 등록합니다
kakao.maps.event.addListener(map, 'idle', function () {
    searchAddrFromCoords(map.getCenter(), displayCenterInfo);
});

function searchAddrFromCoords(coords, callback) {
    // 좌표로 행정동 주소 정보를 요청합니다
    geocoder.coord2RegionCode(coords.getLng(), coords.getLat(), callback);
}

function searchDetailAddrFromCoords(coords, callback) {
    // 좌표로 법정동 상세 주소 정보를 요청합니다
    geocoder.coord2Address(coords.getLng(), coords.getLat(), callback);
}

// 지도 좌측상단에 지도 중심좌표에 대한 주소정보를 표출하는 함수입니다
function displayCenterInfo(result, status) {

    if (status === kakao.maps.services.Status.OK) {
        var infoDiv = document.getElementById('centerAddr');

        for (var i = 0; i < result.length; i++) {
            // 행정동의 region_type 값은 'H' 이므로
            if (result[i].region_type === 'H') {
                infoDiv.innerHTML = result[i].address_name;
                break;
            }
        }
    }
}

// ----------------------------------------- 현재 위치에서 얻은 주소로 open API의 행정동 단위 상가업소 조회

const recommendLocationList = document.getElementById('recommendation-list');
// 마커 이미지의 이미지 주소
var imageSrc = "https://t1.daumcdn.net/localimg/localimages/07/mapapidoc/markerStar.png";

async function queryNearbyUserLocation(locationNum) {
    const limit = 1000; // 한번에 최대 1000개의 가게
    const response = await fetch(`http://localhost:8080/locationSearch/${locationNum}/${limit}`);
    // await을 안쓰면 promise객체 반환(pending fullfiled) -- 이후 then
    // await 쓰면 response객체 반환 -- 이후 .json() 변환
    // console.log(response.data); <- 소용x

    return response;
}

async function getNearbyUserLocation(location) {// location = 영통구

    // locationNum = handleLocationToNum("경기도"); //  시 기준 (범위가 너무 크다)

    const locationNum = SiGunGuInfos.find(SiGunGuInfo => {
        const param = SiGunGuInfo.시군구명.split(' ');
        if (param[param.length - 1] === location) {// 가장 뒤에 것
            return SiGunGuInfo;
        }
    }).시군구코드

    try {
        const response = await queryNearbyUserLocation(locationNum);

        response.json().then(
            data => displayNearbyLocation(data.body.items)
        )
        // response.then(res => res.json()).then(json => console.log(json)); fetch해올때부터 await안 쓰면 사용
    } catch (error) {
        console.log(error);
    }
}

function displayNearbyLocation(locations) {
    // 2초의 fetch시간
    loading.classList.remove('active');

    locations.map(location => {
        const elem = document.createElement("LI");
        elem.classList.add('searched-location');
        createMarker(location);
        elem.innerHTML = `<div class="result-inner">
            상호명: ${location.bizesNm} </br>
            상권분류: ${location.indsLclsNm} </br>
            도로명주소: ${location.rdnmAdr} </br>
            지번주소: ${location.lnoAdr}</br>
            </div>
        `;
        recommendLocationList.appendChild(elem);
    })
}

function createMarker(result) {
    // 마커 이미지의 이미지 크기
    var imageSize = new kakao.maps.Size(24, 35);
    // 마커 이미지를 생성합니다    
    var markerImage = new kakao.maps.MarkerImage(imageSrc, imageSize);

    const position = new kakao.maps.LatLng(result.lat, result.lon);

    // 마커를 생성합니다
    var recomendMarker = new kakao.maps.Marker({
        map: map, // 마커를 표시할 지도
        position, // 마커를 표시할 위치
        title: result.bizesNm, // 마커의 타이틀, 마커에 마우스를 올리면 타이틀이 표시됩니다
        image: markerImage // 마커 이미지 
    });

    // 마커에 커서가 오버됐을 때 마커 위에 표시할 인포윈도우를 생성합니다
    var iwContent = `
    <div style="padding:5px;">${recomendMarker.Gb}</div>
    `; // 인포윈도우에 표출될 내용으로 HTML 문자열이나 document element가 가능합니다

    // 인포윈도우를 생성합니다
    var infowindow = new kakao.maps.InfoWindow({
        content: iwContent
    });

    // 마커에 마우스오버 이벤트를 등록합니다
    kakao.maps.event.addListener(recomendMarker, 'mouseover', function () {
        // 마커에 마우스오버 이벤트가 발생하면 인포윈도우를 마커위에 표시합니다
        console.log(recomendMarker);
        infowindow.open(map, recomendMarker);
    });

    // 마커에 마우스아웃 이벤트를 등록합니다
    kakao.maps.event.addListener(recomendMarker, 'mouseout', function () {
        // 마커에 마우스아웃 이벤트가 발생하면 인포윈도우를 제거합니다
        infowindow.close();
    });
    // console.log(recomendMarker);
}

function handleLocationToNum(location) {

    switch (location) {
        case '서울특별시':
            return 11;
        case '부산광역시':
            return 26;
        case '대구광역시':
            return 27;
        case '인천광역시':
            return 28;
        case '광주광역시':
            return 29;
        case '대전광역시':
            return 30;
        case '울산광역시':
            return 31;
        case '세종특별자치시':
            return 36;
        case '경기도':
            return 41;
        case '강원도':
            return 42;
        case '충청북도':
            return 45;
        case '충청남도':
            return 44;
        case '전라북도':
            return 45;
        case '전라남도':
            return 46;
        case '경상북도':
            return 47;
        case '경상남도':
            return 48;
        case '제주특별자치도':
            return 50;
        default:
            return 'error';
    }

}

// 차후에 데이터베이스에 넣기
const SiGunGuInfos = [
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "종로구",
        "시군구코드": 11110
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "중구",
        "시군구코드": 11140
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "용산구",
        "시군구코드": 11170
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "성동구",
        "시군구코드": 11200
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "광진구",
        "시군구코드": 11215
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "동대문구",
        "시군구코드": 11230
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "중랑구",
        "시군구코드": 11260
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "성북구",
        "시군구코드": 11290
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "강북구",
        "시군구코드": 11305
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "도봉구",
        "시군구코드": 11320
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "노원구",
        "시군구코드": 11350
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "은평구",
        "시군구코드": 11380
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "서대문구",
        "시군구코드": 11410
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "마포구",
        "시군구코드": 11440
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "양천구",
        "시군구코드": 11470
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "강서구",
        "시군구코드": 11500
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "구로구",
        "시군구코드": 11530
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "금천구",
        "시군구코드": 11545
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "영등포구",
        "시군구코드": 11560
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "동작구",
        "시군구코드": 11590
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "관악구",
        "시군구코드": 11620
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "서초구",
        "시군구코드": 11650
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "강남구",
        "시군구코드": 11680
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "송파구",
        "시군구코드": 11710
    },
    {
        "시도명": "서울특별시",
        "시도코드": 11,
        "시군구명": "강동구",
        "시군구코드": 11740
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "중구",
        "시군구코드": 26110
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "서구",
        "시군구코드": 26140
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "동구",
        "시군구코드": 26170
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "영도구",
        "시군구코드": 26200
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "부산진구",
        "시군구코드": 26230
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "동래구",
        "시군구코드": 26260
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "남구",
        "시군구코드": 26290
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "북구",
        "시군구코드": 26320
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "해운대구",
        "시군구코드": 26350
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "사하구",
        "시군구코드": 26380
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "금정구",
        "시군구코드": 26410
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "강서구",
        "시군구코드": 26440
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "연제구",
        "시군구코드": 26470
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "수영구",
        "시군구코드": 26500
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "사상구",
        "시군구코드": 26530
    },
    {
        "시도명": "부산광역시",
        "시도코드": 26,
        "시군구명": "기장군",
        "시군구코드": 26710
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "중구",
        "시군구코드": 27110
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "동구",
        "시군구코드": 27140
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "서구",
        "시군구코드": 27170
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "남구",
        "시군구코드": 27200
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "북구",
        "시군구코드": 27230
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "수성구",
        "시군구코드": 27260
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "달서구",
        "시군구코드": 27290
    },
    {
        "시도명": "대구광역시",
        "시도코드": 27,
        "시군구명": "달성군",
        "시군구코드": 27710
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "중구",
        "시군구코드": 28110
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "동구",
        "시군구코드": 28140
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "남구",
        "시군구코드": 28170
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "연수구",
        "시군구코드": 28185
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "남동구",
        "시군구코드": 28200
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "부평구",
        "시군구코드": 28237
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "계양구",
        "시군구코드": 28245
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "서구",
        "시군구코드": 28260
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "강화군",
        "시군구코드": 28710
    },
    {
        "시도명": "인천광역시",
        "시도코드": 28,
        "시군구명": "옹진군",
        "시군구코드": 28720
    },
    {
        "시도명": "광주광역시",
        "시도코드": 29,
        "시군구명": "동구",
        "시군구코드": 29110
    },
    {
        "시도명": "광주광역시",
        "시도코드": 29,
        "시군구명": "서구",
        "시군구코드": 29140
    },
    {
        "시도명": "광주광역시",
        "시도코드": 29,
        "시군구명": "남구",
        "시군구코드": 29155
    },
    {
        "시도명": "광주광역시",
        "시도코드": 29,
        "시군구명": "북구",
        "시군구코드": 29170
    },
    {
        "시도명": "광주광역시",
        "시도코드": 29,
        "시군구명": "광산구",
        "시군구코드": 29200
    },
    {
        "시도명": "대전광역시",
        "시도코드": 30,
        "시군구명": "동구",
        "시군구코드": 30110
    },
    {
        "시도명": "대전광역시",
        "시도코드": 30,
        "시군구명": "중구",
        "시군구코드": 30140
    },
    {
        "시도명": "대전광역시",
        "시도코드": 30,
        "시군구명": "서구",
        "시군구코드": 30170
    },
    {
        "시도명": "대전광역시",
        "시도코드": 30,
        "시군구명": "유성구",
        "시군구코드": 30200
    },
    {
        "시도명": "대전광역시",
        "시도코드": 30,
        "시군구명": "대덕구",
        "시군구코드": 30230
    },
    {
        "시도명": "울산광역시",
        "시도코드": 31,
        "시군구명": "중구",
        "시군구코드": 31110
    },
    {
        "시도명": "울산광역시",
        "시도코드": 31,
        "시군구명": "남구",
        "시군구코드": 31140
    },
    {
        "시도명": "울산광역시",
        "시도코드": 31,
        "시군구명": "동구",
        "시군구코드": 31170
    },
    {
        "시도명": "울산광역시",
        "시도코드": 31,
        "시군구명": "북구",
        "시군구코드": 31200
    },
    {
        "시도명": "울산광역시",
        "시도코드": 31,
        "시군구명": "울주군",
        "시군구코드": 31710
    },
    {
        "시도명": "세종특별자치시",
        "시도코드": 36,
        "시군구명": "세종특별자치시",
        "시군구코드": 36110
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "수원시 장안구",
        "시군구코드": 41111
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "수원시 권선구",
        "시군구코드": 41113
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "수원시 팔달구",
        "시군구코드": 41115
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "수원시 영통구",
        "시군구코드": 41117
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "성남시 수정구",
        "시군구코드": 41131
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "성남시 중원구",
        "시군구코드": 41133
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "성남시 분당구",
        "시군구코드": 41135
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "의정부시",
        "시군구코드": 41150
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "안양시 만안구",
        "시군구코드": 41171
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "안양시 동안구",
        "시군구코드": 41173
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "부천시 원미구",
        "시군구코드": 41195
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "부천시 소사구",
        "시군구코드": 41197
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "부천시 오정구",
        "시군구코드": 41199
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "광명시",
        "시군구코드": 41210
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "평택시",
        "시군구코드": 41220
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "동두천시",
        "시군구코드": 41250
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "안산시 상록구",
        "시군구코드": 41271
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "안산시 단원구",
        "시군구코드": 41273
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "고양시 덕양구",
        "시군구코드": 41281
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "고양시 일산동구",
        "시군구코드": 41285
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "고양시 일산서구",
        "시군구코드": 41287
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "과천시",
        "시군구코드": 41290
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "구리시",
        "시군구코드": 41310
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "남양주시",
        "시군구코드": 41360
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "오산시",
        "시군구코드": 41370
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "시흥시",
        "시군구코드": 41390
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "군포시",
        "시군구코드": 41410
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "의왕시",
        "시군구코드": 41430
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "하남시",
        "시군구코드": 41450
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "용인시 처인구",
        "시군구코드": 41461
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "용인시 기흥구",
        "시군구코드": 41463
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "용인시 수지구",
        "시군구코드": 41465
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "파주시",
        "시군구코드": 41480
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "이천시",
        "시군구코드": 41500
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "안성시",
        "시군구코드": 41550
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "김포시",
        "시군구코드": 41570
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "화성시",
        "시군구코드": 41590
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "광주시",
        "시군구코드": 41610
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "양주시",
        "시군구코드": 41630
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "포천시",
        "시군구코드": 41650
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "여주시",
        "시군구코드": 41670
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "연천군",
        "시군구코드": 41800
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "가평군",
        "시군구코드": 41820
    },
    {
        "시도명": "경기도",
        "시도코드": 41,
        "시군구명": "양평군",
        "시군구코드": 41830
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "춘천시",
        "시군구코드": 42110
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "원주시",
        "시군구코드": 42130
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "강릉시",
        "시군구코드": 42150
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "동해시",
        "시군구코드": 42170
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "태백시",
        "시군구코드": 42190
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "속초시",
        "시군구코드": 42210
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "삼척시",
        "시군구코드": 42230
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "홍천군",
        "시군구코드": 42720
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "횡성군",
        "시군구코드": 42730
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "영월군",
        "시군구코드": 42750
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "평창군",
        "시군구코드": 42760
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "정선군",
        "시군구코드": 42770
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "철원군",
        "시군구코드": 42780
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "화천군",
        "시군구코드": 42790
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "양구군",
        "시군구코드": 42800
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "인제군",
        "시군구코드": 42810
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "고성군",
        "시군구코드": 42820
    },
    {
        "시도명": "강원도",
        "시도코드": 42,
        "시군구명": "양양군",
        "시군구코드": 42830
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "청주시 상당구",
        "시군구코드": 43111
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "청주시 서원구",
        "시군구코드": 43112
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "청주시 흥덕구",
        "시군구코드": 43113
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "청주시 청원구",
        "시군구코드": 43114
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "충주시",
        "시군구코드": 43130
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "제천시",
        "시군구코드": 43150
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "보은군",
        "시군구코드": 43720
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "옥천군",
        "시군구코드": 43730
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "영동군",
        "시군구코드": 43740
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "진천군",
        "시군구코드": 43750
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "괴산군",
        "시군구코드": 43760
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "음성군",
        "시군구코드": 43770
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "증평군",
        "시군구코드": 43785
    },
    {
        "시도명": "충청북도",
        "시도코드": 43,
        "시군구명": "단양군",
        "시군구코드": 43800
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "천안시 동남구",
        "시군구코드": 44131
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "천안시 서북구",
        "시군구코드": 44133
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "공주시",
        "시군구코드": 44150
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "보령시",
        "시군구코드": 44180
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "아산시",
        "시군구코드": 44200
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "서산시",
        "시군구코드": 44210
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "논산시",
        "시군구코드": 44230
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "계룡시",
        "시군구코드": 44250
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "당진시",
        "시군구코드": 44270
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "금산군",
        "시군구코드": 44710
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "부여군",
        "시군구코드": 44760
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "서천군",
        "시군구코드": 44770
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "청양군",
        "시군구코드": 44790
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "홍성군",
        "시군구코드": 44800
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "예산군",
        "시군구코드": 44810
    },
    {
        "시도명": "충청남도",
        "시도코드": 44,
        "시군구명": "태안군",
        "시군구코드": 44825
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "전주시 완산구",
        "시군구코드": 45111
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "전주시 덕진구",
        "시군구코드": 45113
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "군산시",
        "시군구코드": 45130
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "익산시",
        "시군구코드": 45140
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "정읍시",
        "시군구코드": 45180
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "남원시",
        "시군구코드": 45190
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "김제시",
        "시군구코드": 45210
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "완주군",
        "시군구코드": 45710
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "진안군",
        "시군구코드": 45720
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "무주군",
        "시군구코드": 45730
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "장수군",
        "시군구코드": 45740
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "임실군",
        "시군구코드": 45750
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "순창군",
        "시군구코드": 45770
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "고창군",
        "시군구코드": 45790
    },
    {
        "시도명": "전라북도",
        "시도코드": 45,
        "시군구명": "부안군",
        "시군구코드": 45800
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "목포시",
        "시군구코드": 46110
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "여수시",
        "시군구코드": 46130
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "순천시",
        "시군구코드": 46150
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "나주시",
        "시군구코드": 46170
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "광양시",
        "시군구코드": 46230
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "담양군",
        "시군구코드": 46710
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "곡성군",
        "시군구코드": 46720
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "구례군",
        "시군구코드": 46730
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "고흥군",
        "시군구코드": 46770
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "보성군",
        "시군구코드": 46780
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "화순군",
        "시군구코드": 46790
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "장흥군",
        "시군구코드": 46800
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "강진군",
        "시군구코드": 46810
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "해남군",
        "시군구코드": 46820
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "영암군",
        "시군구코드": 46830
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "무안군",
        "시군구코드": 46840
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "함평군",
        "시군구코드": 46860
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "영광군",
        "시군구코드": 46870
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "장성군",
        "시군구코드": 46880
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "완도군",
        "시군구코드": 46890
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "진도군",
        "시군구코드": 46900
    },
    {
        "시도명": "전라남도",
        "시도코드": 46,
        "시군구명": "신안군",
        "시군구코드": 46910
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "포항시 남구",
        "시군구코드": 47111
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "포항시 북구",
        "시군구코드": 47113
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "경주시",
        "시군구코드": 47130
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "김천시",
        "시군구코드": 47150
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "안동시",
        "시군구코드": 47170
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "구미시",
        "시군구코드": 47190
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "영주시",
        "시군구코드": 47210
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "영천시",
        "시군구코드": 47230
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "상주시",
        "시군구코드": 47250
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "문경시",
        "시군구코드": 47280
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "경산시",
        "시군구코드": 47290
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "군위군",
        "시군구코드": 47720
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "의성군",
        "시군구코드": 47730
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "청송군",
        "시군구코드": 47750
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "영양군",
        "시군구코드": 47760
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "영덕군",
        "시군구코드": 47770
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "청도군",
        "시군구코드": 47820
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "고령군",
        "시군구코드": 47830
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "성주군",
        "시군구코드": 47840
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "칠곡군",
        "시군구코드": 47850
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "예천군",
        "시군구코드": 47900
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "봉화군",
        "시군구코드": 47920
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "울진군",
        "시군구코드": 47930
    },
    {
        "시도명": "경상북도",
        "시도코드": 47,
        "시군구명": "울릉군",
        "시군구코드": 47940
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창원시 의창구",
        "시군구코드": 48121
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창원시 성산구",
        "시군구코드": 48123
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창원시 마산합포구",
        "시군구코드": 48125
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창원시 마산회원구",
        "시군구코드": 48127
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창원시 진해구",
        "시군구코드": 48129
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "진주시",
        "시군구코드": 48170
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "통영시",
        "시군구코드": 48220
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "사천시",
        "시군구코드": 48240
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "김해시",
        "시군구코드": 48250
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "밀양시",
        "시군구코드": 48270
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "거제시",
        "시군구코드": 48310
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "양산시",
        "시군구코드": 48330
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "의령군",
        "시군구코드": 48720
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "함안군",
        "시군구코드": 48730
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "창녕군",
        "시군구코드": 48740
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "고성군",
        "시군구코드": 48820
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "남해군",
        "시군구코드": 48840
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "하동군",
        "시군구코드": 48850
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "산청군",
        "시군구코드": 48860
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "함양군",
        "시군구코드": 48870
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "거창군",
        "시군구코드": 48880
    },
    {
        "시도명": "경상남도",
        "시도코드": 48,
        "시군구명": "합천군",
        "시군구코드": 48890
    },
    {
        "시도명": "제주특별자치도",
        "시도코드": 50,
        "시군구명": "제주시",
        "시군구코드": 50110
    },
    {
        "시도명": "제주특별자치도",
        "시도코드": 50,
        "시군구명": "서귀포시",
        "시군구코드": 50130
    }
]